1581525057/yezi_R2/R2_Lift_auto/MDK-ARM/Device/LED/stm32h7_ws281x.h
#ifndef STM32H7_WS281X_H
#define STM32H7_WS281X_H

#include <stdint.h>

#ifndef STM32H7_WS281X_HAL_HEADER
#define STM32H7_WS281X_HAL_HEADER "stm32h7xx_hal.h"
#endif
#include STM32H7_WS281X_HAL_HEADER

#define STM32H7_WS281X_MODE_SOFTWARE    1
#define STM32H7_WS281X_MODE_TIM_PWM_DMA 2

#include "stm32h7_ws281x_config.h"

#ifdef __cplusplus
extern "C" {
#endif

#ifndef STM32H7_WS281X_MODE
#define STM32H7_WS281X_MODE STM32H7_WS281X_MODE_SOFTWARE
#endif

#ifndef STM32H7_WS281X_PHYSICAL_LED_COUNT
#define STM32H7_WS281X_PHYSICAL_LED_COUNT 60U
#endif

#ifndef STM32H7_WS281X_LEDS_PER_CONTROL_POINT
#define STM32H7_WS281X_LEDS_PER_CONTROL_POINT 6U
#endif

#ifndef STM32H7_WS281X_LED_COUNT
#define STM32H7_WS281X_LED_COUNT \
    (STM32H7_WS281X_PHYSICAL_LED_COUNT / STM32H7_WS281X_LEDS_PER_CONTROL_POINT)
#endif

#ifndef STM32H7_WS281X_T0H_NS
#define STM32H7_WS281X_T0H_NS 350U
#endif

#ifndef STM32H7_WS281X_T1H_NS
#define STM32H7_WS281X_T1H_NS 700U
#endif

#ifndef STM32H7_WS281X_BIT_NS
#define STM32H7_WS281X_BIT_NS 1250U
#endif

#ifndef STM32H7_WS281X_RESET_US
#define STM32H7_WS281X_RESET_US 80U
#endif

#if STM32H7_WS281X_MODE == STM32H7_WS281X_MODE_SOFTWARE
#ifndef STM32H7_WS281X_SOFT_GPIO_PORT
#define STM32H7_WS281X_SOFT_GPIO_PORT GPIOA
#endif

#ifndef STM32H7_WS281X_SOFT_GPIO_PIN
#define STM32H7_WS281X_SOFT_GPIO_PIN GPIO_PIN_0
#endif
#endif

#if STM32H7_WS281X_MODE == STM32H7_WS281X_MODE_TIM_PWM_DMA
#ifndef STM32H7_WS281X_TIM_HANDLE
#define STM32H7_WS281X_TIM_HANDLE htim3
#endif

#ifndef STM32H7_WS281X_TIM_CHANNEL
#define STM32H7_WS281X_TIM_CHANNEL TIM_CHANNEL_1
#endif

#ifndef STM32H7_WS281X_PWM_PERIOD_TICKS
#define STM32H7_WS281X_PWM_PERIOD_TICKS 168U
#endif

#ifndef STM32H7_WS281X_PWM_CODE_0
#define STM32H7_WS281X_PWM_CODE_0 ((STM32H7_WS281X_PWM_PERIOD_TICKS) / 3U)
#endif

#ifndef STM32H7_WS281X_PWM_CODE_1
#define STM32H7_WS281X_PWM_CODE_1 (((STM32H7_WS281X_PWM_PERIOD_TICKS) * 2U) / 3U)
#endif

#ifndef STM32H7_WS281X_PWM_RESET_SLOTS
#define STM32H7_WS281X_PWM_RESET_SLOTS 80U
#endif

extern TIM_HandleTypeDef STM32H7_WS281X_TIM_HANDLE;
#endif

typedef struct
{
    uint8_t r;
    uint8_t g;
    uint8_t b;
} STM32H7_WS281X_Color;

void STM32H7_WS281X_Init(void);
uint16_t STM32H7_WS281X_GetLedCount(void);
void STM32H7_WS281X_SetPixel(uint16_t index, STM32H7_WS281X_Color color);
void STM32H7_WS281X_SetAll(STM32H7_WS281X_Color color);
HAL_StatusTypeDef STM32H7_WS281X_Show(void);
void STM32H7_WS281X_Clear(void);

#ifdef __cplusplus
}
#endif

#endif
